{
  "deloitte": "<ul><li><b>Designed and developed scalable data solutions</b> for 15+ pharmaceutical and Medicare business areas, optimizing analytics, care management and reporting resulting in improved member outcomes and significant annual cost savings (e.g., $100K/year via audit automation, 50%+ reduction in Medicare participant POS payments).</li><li><b>Led major environment migrations and modernization efforts</b>, as primary point of contact: Executed a detailed 8-month migration plan, standardized database and code compatibility, authored comprehensive migration guides, and upgraded data frameworks, enabling cross-team onboarding and sustained project velocity while minimizing risks and rework.</li><li><b>Automated and enhanced critical data engineering processes</b>: Slashed configuration and mapping times from up to 120 minutes to seconds, redesigned workflows and frameworks for financial applications, and implemented reusable data audit and validation components that reduced manual effort by 1000+ hours and improved data quality (up to 40% decrease in discrepancies).</li><li><b>Engineered unified frameworks and system components</b> for data checks, compaction, retention, and CDC (Change Data Capture), cutting storage costs by up to 10%, decreasing development estimates by 25-30%, and boosting overall maintainability and reliability across 230+ pipelines.</li><li><b>Orchestrated cross-functional collaboration and knowledge transfer</b>: Coordinated teams for migration and validation, conducted documentation and hands-on knowledge sharing for seamless on-boarding and transition, and supported production releases, testing cycles for 20+ new workflows.</li><li><b>Advanced technical proficiency</b>: Transitioned automation tools (e.g. Zena to Control-M), implemented CI/CD and testing best practices, completed Azure and Databricks certifications and attended 3-day training on Gen-AI data engineering and continually improved pipeline performance, scalability and cost efficiency.</li></ul>",
  "finezza": "<ul><li>Built a product specification for a new feature in one of Finezza’s verticals</li><li>Designed User Interfaces for the new feature using Sketch.</li><li>Demonstrated and explained the product’s features to the prospects and writing a blog post for the corporate blog.</li></ul>",
  "upraised": "<ul><li>Studied and Learnt various skills required for a product manager ranging from designing a customer journey, a roadmap, using prioritizing frameworks, product design, etc.</li><li>Looked into and studied various products and their case studies to make important observations about the product design, marketing, etc.</li><li>Built a product case study on PhonePe on how to reduce customer churn on the platform by employing 4 different prioritized solutions and creating a plan of action.</li></ul>"
}
