{
  "deloitte": "<ul><li><b>Built and scaled analytics-ready data platforms</b> supporting 15+ pharmaceutical and Medicare domains, enabling care management and reporting use cases that improved member outcomes and delivered measurable cost savings (e.g., $100K/year via audit automation, 50%+ reduction in POS payments).</li><li><b>Led large-scale data platform modernization</b> as primary technical owner, defining an 8-month execution roadmap, coordinating cross-team dependencies, and standardizing schemas and codebases to reduce analytical friction and improve data usability.</li><li><b>Designed data validation and audit workflows</b> to detect anomalies in financial and healthcare datasets, perform root-cause analysis on discrepancies, and validate business metrics, reducing configuration time from hours to seconds and lowering data inconsistencies by up to 40%.</li><li><b>Engineered reusable data quality, CDC, and retention frameworks</b> to improve dataset reliability and traceability across 230+ pipelines, enabling consistent downstream analysis while reducing storage costs by 10% and development effort by 25–30%.</li><li><b>Collaborated with Senior Data Analysts on exploratory data analysis and data modeling</b> advising on schema design and architectural constraints, evaluating model feasibility, and guiding redesigns to ensure analytically sound and production-ready data models.</li><li><b>Partnered with analytics, QA, and business stakeholders</b> to validate datasets, support production releases, and enable 20+ analytical and reporting workflows through documentation and hands-on knowledge transfer.</li></ul>",
  "finezza": "<ul><li>Developed a product specification (PRD) for a new feature by <b>analyzing market trends, defining success metrics, and translating business requirements</b> into actionable technical specifications, enabling data-driven decisions.</li><li><b>Presented product insights and value proposition to stakeholders and potential clients</b>, supporting data-informed discussions and prioritization.</li></ul>",
  "upraised": "<ul><li>Studied and Learnt various skills required for a product manager ranging from designing a customer journey, a roadmap, using prioritizing frameworks, product design, etc.</li><li>Looked into and studied various products and their case studies to make important observations about the product design, marketing, etc.</li><li>Built a product case study on PhonePe on how to reduce customer churn on the platform by employing 4 different prioritized solutions and creating a plan of action.</li></ul>"
}
